cmsis-svd/cmsis-svd/data/Infineon/psoc4200m.svd
        <register>
          <name>CONFIG</name>
          <description>CAN Configuration</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>EDGE_MODE</name>
              <description>CAN bus synchronization logic
'0': Edge from 'R' to 'D' is used for synchronization
'1': Both edges are used
Note, only  'R' to 'D' edge shall be used for synchronization per ISO-11898-1 spec, so this bit should always be set 0 (by default)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLING_MODE</name>
              <description>CAN bus bit sampling
'0': One sampling point is used in the receiver
path
'1': 3 sampling points with majority decision are
used</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_SJW</name>
              <description>Synchronization jump width - 1
sjw &lt;= tseg1 and sjw &lt;=  tseg2</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTO_RESTART</name>
              <description>'0': After bus-off, the CAN core must be restarted by setting 
     COMMAND.RUN register. This is the recommended setting.
'1': After bus-off, the CAN core is restarting automatically 
     after 128 groups of 11 recessive bits</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_TSEG2</name>
              <description>Time segment 2
Length of the second time segment:
tseg2 = cfg_tseg2 + 1
cfg_tseg2=0 is not allowed; cfg_tseg2=1 is only
allowed in direct sampling mode.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_TSEG1</name>
              <description>Time segment 1
Length of the first time segment:
tseg1 = cfg_tseg1 + 1
Time segment 1 includes the propagation time.
cfg_tseg1=0 and cfg_tseg1=1 are not allowed.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ARBITER</name>
              <description>Transmit buffer arbiter
'0': Round robin arbitration
'1': Fixed priority arbitration</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP_ENDIAN</name>
              <description>Swap Endian - the byte position of the CAN receive and transmit data fields can be modified to match the endian setting of the processor or the used CAN protocol
0: CAN data byte position is not swapped (big endian)
1: CAN data byte position is swapped (little endian)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ECR_MODE</name>
              <description>Error Capture mode
0: Free running: The ECR register shows the current bit position within the CAN frame
1: Capture mode: The ecr register shows the bit position and type of the last captured CAN error.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_BITRATE</name>
              <description>Prescaler for generating the time quantum
which defines the TQ:
0: One time quantum equals 1 clock cycle
1: One time quantum equals 2 clock cycles
...
32767: One time quantum equals 32768 clock
cycles</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <description>Error Capture Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>ECR_STATUS</name>
              <description>ECR STATUS -
0: ECR register captured an error, or it is in free running mode
1: ECR register is armed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_TYPE</name>
              <description>Error type -
000 : Arbitration loss
001 : Bit Error
010 : Bit Stuffing Error
011 : Acknowledge Error
100 : Form Error
101 : CRC Error
Others : N/A</description>
              <bitRange>[3:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>RX Mode -
0: No status
1: CAN Controller is receiver</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_MODE</name>
              <description>TX Mode -
0: No status
1: CAN Controller is transmitter</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BIT</name>
              <description>Bit number inside of Field</description>
              <bitRange>[11:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>Field -
0x00 : Stopped
0x01 : Synchronize
0x05 : Interframe
0x06 : Bus Idle
0x07 : Start of Frame
0x08 : Arbitration
0x09 : Control
0x0A : Data
0x0B : CRC
0x0C : ACK
0x0D : End of frame
0x10 : Error flag
0x11 : Error echo
0x12 : Error delimiter
0x18 : Overload flag
0x19 : Overload echo
0x1A : Overload delimiter
Others : N/A</description>
              <bitRange>[16:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>16</dimIncrement>
          <name>TX[%s]</name>
          <description>TxMessage Buffer control/command</description>
          <addressOffset>0x00000020</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>TxMessage Buffer control/command</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>TX_REQ</name>
                <description>TxReq, Transmit Request
Write:
'0': idle
'1': Message Transmit Request5
Read:
'0': TxReq completed
'1': TxReq pending</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_ABORT</name>
                <description>Transmit Abort Request
'0': idle
'1': Requests removal of a pending message. 
The message is removed the next time an arbitration
loss happens or a CAN error is detected. 
The flag is cleared when the message was removed or when the
message won arbitration. 
The TxReq flag is released at the same time

when there is a pending TX message (read out TxReq=1 and TxAbort=0), Writing TxReq=1 and TxAbort=1 has no effect.

