cmsis-svd/cmsis-svd/data/Infineon/psoc4200m.svd
depending on RTR_REPLY setting,
0, this field will be updated by received data/remote frame
1, this field should be aligned offline and set by user in advance, will not be updated by received data/remote frame, and will be sent out in responsive data frame</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IDE_FMT</name>
                <description>Extended Identifier Bit
'1': This is an extended format message
'0': This is a standard format message

depending on RTR_REPLY setting,
0, this field will be updated by received data/remote frame
1, this field should be aligned offline and set by user in advance, will not be updated by received data/remote frame, and will be sent out in responsive data frame</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RTR_MSG</name>
                <description>Remote Bit
'1': This is an RTR message
'0': This is a regular message

depending on RTR_REPLY setting,
0, this field will be updated by received data/remote frame
1, this field should be set to 0 (data frame type) by user in advance, will not be updated by received data/remote frame, and will be sent out in responsive data frame</description>
                <bitRange>[21:21]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WPNH</name>
                <description>N/A</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ID</name>
            <description>Identifier</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>RxMessage: Identifier</description>
                <bitRange>[31:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA_HIGH</name>
            <description>RxMessage Data high</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data[63:32]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA_LOW</name>
            <description>RxMessage Data low</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data[31:0]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AMR</name>
            <description>Acceptance Mask Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>RTR</name>
                <description>N/A</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IDE</name>
                <description>N/A</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ID</name>
                <description>Identifier
it cannot be used to match both 11bit and 29bit identifiers,
in case of 11bit identifiers, lower 18bits should be all ones (don't care)</description>
                <bitRange>[31:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACR</name>
            <description>Acceptance Code Register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>RTR</name>
                <description>N/A</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IDE</name>
                <description>N/A</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ID</name>
                <description>Identifier</description>
                <bitRange>[31:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AMR_DATA</name>
            <description>Acceptance Mask Register - Data</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATAL</name>
                <description>Data[63:48],
when DUT is NOT configured to receive only DATA frame, this register should be configured with all ones (don't care)</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACR_DATA</name>
            <description>Acceptance Code Register - Data</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATAL</name>
                <description>Data[63:48]</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CNTL</name>
          <description>Control</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000001</resetMask>
          <fields>
            <field>
              <name>TT_ENABLE</name>
              <description>TTCAN enable/disable
0=TTCAN is disabled; Interrupt_can is sourced from 3PIP.
     INT_EBL.GLOBAL_INT_ENBL &amp;  (INT_EBL[i] &amp; INT_STATUS[i])
1=TTCAN is enabled; Interrupt_can is sourced from  INTR_CAN_MASKED.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_ENABLE</name>
              <description>IP Enable/Disable
0=IP is disabled/reset
1=IP is enabled/running</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTCAN_COUNTER</name>
          <description>TTCAN Level1 16-Bit local time counter</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>LOCAL_TIME</name>
              <description>Bit time counter in TTCAN level 1</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTCAN_COMPARE</name>
          <description>TTCAN Level1 compare configuration</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>TIME_MARK</name>
              <description>compare target,
when TTCAN_COUNTER.LOCAL_TIME counts to TT_COMPARE, INTR_CAN.TT_COMPARE will be set</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTCAN_CAPTURE</name>
          <description>TTCAN Level1 capture configuration</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>SYNC_MARK</name>
              <description>copy TTCAN_COUNTER.LOCAL_TIME to TTCAN_CAPTURE.SYNC_MARK, when SOF detected.
when new event triggers, new LOCAL_TIME value will overwrite previous SYNC_MARK value</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTCAN_TIMING</name>
          <description>TTCAN Level1 timing configuration, duplicate of CONFIG fields</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFF0FE2</resetMask>
          <fields>
            <field>
              <name>SAMPLING_MODE</name>
              <description>CAN bus bit sampling
'0': One sampling point is used in the receiver path
'1': 3 sampling points with majority decision are used</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_TSEG2</name>
              <description>Time segment 2
Length of the second time segment:
tseg2 = cfg_tseg2 + 1
cfg_tseg2=0 is not allowed; cfg_tseg2=1 is only
allowed in direct sampling mode.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_TSEG1</name>
              <description>Time segment 1
Length of the first time segment:
tseg1 = cfg_tseg1 + 1
Time segment 1 includes the propagation time.
cfg_tseg1=0 and cfg_tseg1=1 are not allowed.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_BITRATE</name>
              <description>Prescaler for generating the time quantum
which defines the TQ:
0: One time quantum equals 1 clock cycle
1: One time quantum equals 2 clock cycles
...
32767: One time quantum equals 32768 clock
cycles</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CAN</name>
          <description>CAN Interrupt Cause (TTCAN + INT_STATUS Or)</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>INT_STATUS</name>
              <description>Triggers when any enabled (INT_EBL) interrupt are set in INT_STATUS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TT_COMPARE</name>
              <description>Triggers when LOCAL_TIME is equal to TT_COMPARE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TT_CAPTURE</name>
              <description>Triggers when LOCAL_TIME is saved to TT_CAPTURE, on SOF detection</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CAN_SET</name>
          <description>CAN Interrupt Set (TTCAN + INT_STATUS Or)</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>INT_STATUS</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TT_COMPARE</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TT_CAPTURE</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CAN_MASK</name>
          <description>CAN Interrupt Mask (TTCAN + INT_STATUS Or)</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>INT_STATUS</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TT_COMPARE</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TT_CAPTURE</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CAN_MASKED</name>
          <description>Can Interrupt Masked (TTCAN + INT_STATUS Or)</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>INT_STATUS</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TT_COMPARE</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TT_CAPTURE</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
